#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ssaggu-lab-1/gh-actions-demo/runs/run-JHhoKrFXSoAsXZBm

Waiting for the plan to start...

Terraform v1.2.3
on linux_amd64
Initializing plugins and modules...
data.aws_ami.ubuntu: Reading...
data.aws_ami.ubuntu: Read complete after 1s [id=ami-00d27ac4138d503ce]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                          = "ami-00d27ac4138d503ce"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tenancy                      = (known after apply)
      + user_data                    = "d36263b945850b1251dc22e4ed5c62aeb9e9e0f0"
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.web-sg will be created
  + resource "aws_security_group" "web-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # random_pet.sg will be created
  + resource "random_pet" "sg" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + web-address = (known after apply)

------------------------------------------------------------------------

Organization Policy Check:

==================== Results for policy set: cloud_agnostic ====================

Sentinel Result: true

This result means that all Sentinel policies passed and the protected
behavior is allowed.

22 policies evaluated.

## Policy 1: cloud_agnostic/allowed-resources (advisory)

Result: false (allowed failure based on level)

Description:
  This policy uses the tfconfig/v2 import to allow resources  from an allowed list

Print messages:

aws_security_group.web-sg has type with value aws_security_group that is not in the allowed list: [aws_instance, azurerm_virtualmachine, google_compute_instance]
random_pet.sg has type with value random_pet that is not in the allowed list: [aws_instance, azurerm_virtualmachine, google_compute_instance]

./allowed-resources.sentinel:21:1 - Rule "main"
  Description:
    Main rule

  Value:
    false

## Policy 2: cloud_agnostic/require-all-resources-from-pmr (advisory)

Result: false (allowed failure based on level)

Description:
  This policy uses the tfconfig/v2 import to require that all non-root  modules come from the Private Module Registry and that no resources  or data sources are created in the root module.

Print messages:

Resources and data sources are not allowed in the root module.
Your root module has 4 resources and data sources.

./require-all-resources-from-pmr.sentinel:58:1 - Rule "main"
  Value:
    false

## Policy 3: cloud_agnostic/allowed-datasources (advisory)

Result: true

Description:
  This policy uses the tfconfig/v2 import to allow data sources  contained in an allowed list

./allowed-datasources.sentinel:21:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 4: cloud_agnostic/allowed-providers (advisory)

Result: true

Description:
  This policy uses the tfconfig/v2 import to restrict providers to those  in an allowed list.

./allowed-providers.sentinel:78:1 - Rule "main"
  Value:
    true

## Policy 5: cloud_agnostic/allowed-provisioners (advisory)

Result: true

Description:
  This policy uses the tfconfig/v2 import to specified provisioners  in an allowed list

./allowed-provisioners.sentinel:23:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 6: cloud_agnostic/limit-cost-and-percentage-increase (advisory)

Result: true

Description:
  This policy uses the Sentinel tfrun import to restrict the  both the total monthly cost and the percentage increase in  the monthly cost that would be incurred if the current plan  were applied

Print messages:

No cost estimates available

./limit-cost-and-percentage-increase.sentinel:21:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 7: cloud_agnostic/limit-cost-by-workspace-name (advisory)

Result: true

Description:
  This policy uses the Sentinel tfrun import to restrict the  proposed monthly cost that would be incurred if the current  plan were applied, using different limits for different  workspaces based on their names.

Print messages:

No cost estimates available

./limit-cost-by-workspace-name.sentinel:24:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 8: cloud_agnostic/limit-proposed-monthly-cost (advisory)

Result: true

Description:
  This policy uses the Sentinel tfrun import to restrict the  proposed monthly cost that would be incurred if the current  plan were applied

Print messages:

No cost estimates available

./limit-proposed-monthly-cost.sentinel:19:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 9: cloud_agnostic/prevent-destruction-of-prohibited-resources (advisory)

Result: true

Description:
  This policy prevents the destruction without re-creation of resources  of prohibited types.

./prevent-destruction-of-prohibited-resources.sentinel:22:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 10: cloud_agnostic/prevent-non-root-providers (advisory)

Result: true

Description:
  This policy uses the tfconfig/v2 import to prevent providers from being  created in non-root modules. Only provider proxy configuration blocks  that do not have any config are allowed.

Print messages:

Providers that are not proxy configuration blocks are only allowed in the root module.

./prevent-non-root-providers.sentinel:36:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 11: cloud_agnostic/prevent-remote-exec-provisioners-on-null-resources (advisory)

Result: true

Description:
  This policy uses the tfconfig/v2 import to prevent remote-exec provisioners  from being used on null resources

Print messages:

remote-exec provisioners are not allowed on null resources.

./prevent-remote-exec-provisioners-on-null-resources.sentinel:24:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 12: cloud_agnostic/prohibited-datasources (advisory)

Result: true

Description:
  This policy uses the tfconfig/v2 import to prohibit data sources  in a prohibited list

./prohibited-datasources.sentinel:20:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 13: cloud_agnostic/prohibited-providers (advisory)

Result: true

Description:
  This policy uses the tfconfig/v2 import to prohibit providers  from a prohibited list

./prohibited-providers.sentinel:64:1 - Rule "main"
  Value:
    true

## Policy 14: cloud_agnostic/prohibited-provisioners (advisory)

Result: true

Description:
  This policy uses the tfconfig/v2 import to prohibit specified provisioners  from a prohibited list

./prohibited-provisioners.sentinel:23:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 15: cloud_agnostic/prohibited-resources (advisory)

Result: true

Description:
  This policy uses the tfconfig/v2 import to prohibit resources  from a prohibited list

./prohibited-resources.sentinel:20:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 16: cloud_agnostic/require-all-modules-have-version-constraint (advisory)

Result: true

Description:
  This policy uses the tfconfig/v2 import to require modules to have  version constraint, this is a good practise.

./require-all-modules-have-version-constraint.sentinel:24:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 17: cloud_agnostic/require-all-providers-have-version-constraint (advisory)

Result: true

Description:
  This policy uses the tfconfig/v2 import to require providers to have  version constraint, this is a good practise.

./require-all-providers-have-version-constraint.sentinel:23:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 18: cloud_agnostic/restrict-databricks-clusters (advisory)

Result: true

Description:
  This policy uses the Sentinel tfplan/v2 import to restrict the  max number of workers in Databricks clusters and the sizes of their VMs

./restrict-databricks-clusters.sentinel:40:1 - Rule "main"
  Value:
    true

## Policy 19: cloud_agnostic/restrict-panos-srgs (advisory)

Result: true

Description:
  This policy uses the Sentinel tfplan/v2 import to restrict the  destination addresses of Palo Alto Networks security rule groups  to not have "any".

./restrict-panos-srgs.sentinel:35:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 20: cloud_agnostic/restrict-remote-state (advisory)

Result: true

Description:
  This policy uses the Sentinel tfstate and tfrun imports to restrict the  workspaces from which remote state can be retrieved using the  terraform_remote_state data source. It provides a map between  prefixes and suffixes of names of workspaces that want to read remote state  and specific workspaces from which they can read it.

./restrict-remote-state.sentinel:91:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 21: cloud_agnostic/restrict-resources-by-module-source (advisory)

Result: true

Description:
  This policy restricts resources of specific types to only be created in  modules with sources in a given list of modules from public and private module  registries or in their nested modules.  If you want to allow creation of the resources in the root module, include  "root" in the `allowed_module_sources` list. But you generally would not  want to allow "root" since that sacrifices most control over creation of  the resource types in `restricted_resources`.  Note that this policy allows creation of resources in module blocks that  point directly against a sub-directory of a module with a reference like  "app.terraform.io/Cloud-Operations/s3-bucket/aws//modules/notification".

./restrict-resources-by-module-source.sentinel:143:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 22: cloud_agnostic/validate-variables-have-descriptions (advisory)

Result: true

Description:
  This policy uses the tfconfig/v2 import to validate that all variables  have descriptions

./validate-variables-have-descriptions.sentinel:24:1 - Rule "main"
  Description:
    Main rule

  Value:
    true



```

</details>

*Pushed by: @sukhsaggu, Action: `pull_request`*